
print("Программа проверяет наименьшее число на четность")
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
if a > b:
    if a % 2 == 0:
        print("первое число больше второго и четное")
    else:
        print("первое число больше второго и нечетное")
elif a < b:
    if b % 2 == 0:
        print("второе число больше первого и четное")
    else:
        print("второе число больше первого и нечетное")
else:
    if a % 2 == 0 and b % 2 == 0:
        print("первое число равно второму и оба они четные")
    else:
        print("первое число равно второму и оба они нечетные")