print("""
                                                         ax^2 + bx + c = 0
Программа проверяет на действительность корней уравнения bx^2 + ax + c = 0
                                                         cx^2 + ax + b = 0""")
def proverka(a, b, c):
    return b**2 - 4*a*c



a = float(input("Введите a: "))
b = float(input("Введите b: "))
c = float(input("Введите c: "))
if proverka(a, b, c) == 0:
    print("Первое уравнение имеет два одинаковых действ. корня")
elif proverka(a, b, c) > 0:
    print("Первое уравнение имеет два разных действ. корня")

if proverka(b, a, c) == 0:
    print("Второе уравнение имеет два одинаковых действ. корня")
elif proverka(b, a, c) > 0:
    print("Второе уравнение имеет два разных действ. корня")

if proverka(c, a, b) == 0:
    print("Третье уравнение имеет два одинаковых действ. корня")
elif proverka(c, a, b) > 0:
    print("Третье уравнение имеет два разных действ. корня")
