{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 784], "init": "normal", "W_constraint": null, "bias": true, "b_regularizer": null, "output_dim": 512, "activation": "relu", "W_regularizer": null, "name": "dense_1", "input_dim": 784, "activity_regularizer": null, "trainable": true, "input_dtype": "float32", "b_constraint": null}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 784], "init": "normal", "W_constraint": null, "bias": true, "b_regularizer": null, "output_dim": 512, "activation": "relu", "W_regularizer": null, "name": "dense_2", "input_dim": 512, "activity_regularizer": null, "trainable": true, "input_dtype": "float32", "b_constraint": null}}, {"class_name": "Dense", "config": {"init": "normal", "W_constraint": null, "bias": true, "b_regularizer": null, "output_dim": 10, "activation": "softmax", "W_regularizer": null, "name": "dense_3", "input_dim": 512, "activity_regularizer": null, "trainable": true, "b_constraint": null}}]}